# 1. Створити програму, яка буде очікувати від користувача введення тексту і виведе інформацію по кожному
#    надрукованому символу:
#
#       це “число” + яке воно (парне, непарне),
#       це “буква” + яка вона (велика чи маленька),
#       це “символ”
#
# 2. Створити програму, яка буде друкувати в консоль “I love Python” кожні 4.2 секунди, поки її виконання не буде
#    перервано вручну.
# ===================================================

from time import sleep


# Task 1.
common_text = input('Введіть текст: ')
for char in common_text:
    if char.isdigit():
        print(f'{char} - це “число”.', end=' ')
        print('Воно парне.' if int(char) % 2 == 0 else 'Воно непарне.')
    elif char.isalpha():
        print(f'{char} - це “буква”.', end=' ')
        print('Вона велика.' if char.isupper() else 'Вона маленька.')
    else:
        print(f'{char} - це “символ”.')

# Tack 2.
while True:
    sleep(4.2)
    print('I love Python')
